
# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  
  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BottleNeck, 3, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, BottleNeck, 4, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BottleNeck, 6, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BottleNeck, 3, 5, 'relu']] # 7-P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0

  - [-1, 1, DySample,  [2, 'lp']] # 11
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 12 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 13
  - [-1, 3, RepC3, [256, 0.5]]  # 14, fpn_blocks.0
  - [-1, 1, Conv, [128, 1, 1]]   # 15, Y4, lateral_convs.1

  - [-1, 1, DySample,  [2, 'lp']] # 16
###########################################################################################################
  - [2, 1, Focus, [64, 1]] # 17
  - [[4, -1], 1, Concat, [1]] # 18
  - [-1, 1, WTConv2dMaxPool, [128, 0.5, 5, 2]] # 19

  - [4, 1, Focus, [128, 1]] # 20
  - [17, 1, Focus, [128, 1]] # 21
  - [[-2, -1], 1, Concat, [1]] # 22
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, False]] # 23
  - [-1, 1, WTConv2d, [128, 5, 1]]# 24
  - [[19, -1], 1, SEcatv2, [0]] # 25
  - [-1, 1, FFC, [128]] # 26
 ##########################################################################################################
  - [[5, 16, -1], 1, Concat, [1]] # 27
  - [-1, 1, MFFF, [ ] ] # 28
  - [-1, 3, RepC3, [256, 0.5]] # 29

  - [-1, 1, WTConv2dMaxPool, [256, 0.5, 5, 2]]   # 30
  - [[-1, 15], 1, SEcatv2, []] # 31
  - [-1, 3, RepC3, [256, 0.5]] # 32

  - [-1, 1, WTConv2dMaxPool, [256, 0.5, 5, 2]]   # 33
  - [[-1, 10], 1, SEcatv2, []] # 34
  - [-1, 3, RepC3, [256, 0.5]] # 35

  - [[29, -1], 1, SemanticAlignmenCalibration, [ ]] # 36

  - [[32, 35, 36], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # RTDETRDecoder(P3, P4, P5)